#pragma once
#include <string>
#include <iostream>
#include <fstream>
using namespace std;

void WriteFile(string FileName, string* a, int n);

template<class T>
void WriteBinaryFile(string FileName, T* a, int n)
{
	/////////////////////////////////////////////////////////////////////////////////////
	//将排序结果输出到文件
	cout << endl << endl << endl;
	cout << "\t||===============================================================||" << endl;
	cout << "\t||---------------------------------------------------------------||" << endl;
	cout << "\t||--------------------------正在保存文件-------------------------||" << endl;
	ofstream output;
	output.open(FileName, ios::out | ios::binary);
	output.write((char*)a, sizeof(T) * n);
	output.close();
	cout << "\t||----------------数据保存在 " << FileName << " 文件中" << endl;
	cout << "\t||---------------------------------------------------------------||" << endl;
	cout << "\t||===============================================================||" << endl;
	/////////////////////////////////////////////////////////////////////////////////////	
}
template<class T>
void ReadBinaryFile(string FileName, T* a, int n)
{
	/////////////////////////////////////////////////////////////////////////////////////
	//将排序结果输出到文件
	cout << endl << endl << endl;
	cout << "\t||===============================================================||" << endl;
	cout << "\t||---------------------------------------------------------------||" << endl;
	cout << "\t||--------------------------正在读取文件-------------------------||" << endl;
	ifstream input;
	input.open(FileName, ios::in | ios::binary);
	input.read((char*)a, sizeof(T) * n);
	input.close();
	cout << "\t||----------------数据读取从 " << FileName << " 文件中" << endl;
	cout << "\t||---------------------------------------------------------------||" << endl;
	cout << "\t||===============================================================||" << endl;
	/////////////////////////////////////////////////////////////////////////////////////	
}
template<class T>
void WriteClsFile(string FileName, T* a, int n)
{
	/////////////////////////////////////////////////////////////////////////////////////
	//将排序结果输出到文件
	cout << endl << endl << endl;
	cout << "\t||===============================================================||" << endl;
	cout << "\t||---------------------------------------------------------------||" << endl;
	cout << "\t||--------------------------正在保存文件-------------------------||" << endl;
	ofstream output;
	output.open(FileName, ios::out);

	for (int i = 0; i < n; i++)
	{
		output << a[i] << endl;
	}
	output.close();
	cout << "\t||----------------数据保存在 " << FileName << " 文件中" << endl;
	cout << "\t||---------------------------------------------------------------||" << endl;
	cout << "\t||===============================================================||" << endl;
	/////////////////////////////////////////////////////////////////////////////////////	
}